---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalMap
source: html/97d6d235-f371-aab3-6995-bdba42b5e462.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalMap Property

An external resource type representing Decal linked data for diffuse.
 This type is reserved for future expansion but not yet implemented.

## Syntax (C#)
```csharp
public static ExternalResourceType DecalMap { get; }
```